/**
 * @file lib.h
 * @brief Заголовочний файл з прототипами функцій для обчислення квадратної матриці та функції НСД.
 */

#ifndef LIB_H
#define LIB_H

/**
 * @brief Виконує обчислення квадратної матриці.
 *
 * @param MatIn     Вказівник на вхідну квадратну матрицю.
 * @param MatOut    Вказівник на вихідну квадратну матрицю.
 * @param size      Розмір квадратних матриць.
 * @return          Вказівник на отриману квадратну матрицю (`MatOut`).
 */
int **SquareMat(int **mat_in, int **mat_out, int size);

/**
 * @brief Обчислює найбільший спільний дільник (НСД) двох чисел.
 *
 * @param x     Перше число.
 * @param y     Друге число.
 * @return      НСД чисел `x` та `y`.
 */
int gcd(int num1, int num2);

#endif /* LIB_H */
